#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-VukyPxXa62DMzvLc

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=1407615633]
data.aws_iam_policy_document.vmimport_base: Refreshing state...
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=2377160203]
data.aws_iam_policy_document.vmimport_trust: Refreshing state...
aws_iam_user.imagebuilder_stage: Refreshing state... [id=imagebuilder-stage]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
aws_iam_user.imagebuilder_prod: Refreshing state... [id=imagebuilder-prod]
aws_iam_user_policy_attachment.imagebuilder_stage_s3: Refreshing state... [id=imagebuilder-stage-20201113204258227600000002]
aws_iam_user_policy_attachment.imagebuilder_prod_s3: Refreshing state... [id=imagebuilder-prod-20201113204258223300000001]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.vmimport_base will be created
  + resource "aws_iam_policy" "vmimport_base" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "vmimport_base"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::imagebuilder-stage/*",
                          + "arn:aws:s3:::imagebuilder-stage",
                          + "arn:aws:s3:::imagebuilder-prod/*",
                          + "arn:aws:s3:::imagebuilder-prod",
                        ]
                      + Sid      = "1"
                    },
                  + {
                      + Action   = [
                          + "ec2:RegisterImage",
                          + "ec2:ModifySnapshotAttribute",
                          + "ec2:Describe*",
                          + "ec2:CopySnapshot",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "2"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.vmimport will be created
  + resource "aws_iam_role" "vmimport" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Condition = {
                          + StringLike = {
                              + sts:Externalid = "vmimport"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vmie.amazonaws.com"
                        }
                      + Sid       = "1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vmimport"
      + path                  = "/"
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder vmimport role"
          + "ServiceOwner" = "Image Builder"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.vmimport_base will be created
  + resource "aws_iam_role_policy_attachment" "vmimport_base" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "vmimport"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*